CSI API ETABS v1
cTendonObj.GetLoadForceStress_1 Method
 Retrieves tendon load data
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadForceStress_1(
	string Name,
	ref int NumberItems,
	ref string[] TendonName,
	ref string[] LoadPatFinal,
	ref string[] LoadPatTransfer,
	ref int[] JackFrom,
	ref int[] LoadType,
	ref double[] LoadValue,
	ref int[] LossSpecification,
	eItemType ItemType = eItemType.Objects
)
Function GetLoadForceStress_1 (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef TendonName As String(),
	ByRef LoadPatFinal As String(),
	ByRef LoadPatTransfer As String(),
	ByRef JackFrom As Integer(),
	ByRef LoadType As Integer(),
	ByRef LoadValue As Double(),
	ByRef LossSpecification As Integer(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberItems As Integer
Dim TendonName As String()
Dim LoadPatFinal As String()
Dim LoadPatTransfer As String()
Dim JackFrom As Integer()
Dim LoadType As Integer()
Dim LoadValue As Double()
Dim LossSpecification As Integer()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLoadForceStress_1(Name,
	NumberItems, TendonName, LoadPatFinal,
	LoadPatTransfer, JackFrom, LoadType,
	LoadValue, LossSpecification, ItemType)
int GetLoadForceStress_1(
	String^ Name,
	int% NumberItems,
	array<String^>^% TendonName,
	array<String^>^% LoadPatFinal,
	array<String^>^% LoadPatTransfer,
	array<int>^% JackFrom,
	array<int>^% LoadType,
	array<double>^% LoadValue,
	array<int>^% LossSpecification,
	eItemType ItemType = eItemType::Objects
)
abstract GetLoadForceStress_1 :
        Name : string *
        NumberItems : int byref *
        TendonName : string[] byref *
        LoadPatFinal : string[] byref *
        LoadPatTransfer : string[] byref *
        JackFrom : int[] byref *
        LoadType : int[] byref *
        LoadValue : float[] byref *
        LossSpecification : int[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing tendon object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of items retrieved for the specified tendon objects
TendonName
Type: System.String[]
 This is an array that includes the name of the tendon object associated with each value.
LoadPatFinal
Type: System.String[]
 This is an array that includes the final load pattern name
LoadPatTransfer
Type: System.String[]
 This is an array that includes the transfer load pattern name
JackFrom
Type: System.Int32[]
 The jacking location, an item from the following list
Start Of Tendon
End Of Tendon
Both Ends
LoadType
Type: System.Int32[]
 This is an array that includes either 0 or 1, indicating the type of load
0 = Force
1 = Stress
LoadValue
Type: System.Double[]
 This is an array that includes the load value. [F] when LoadType is 0, and [F/L2] when LoadType is 1
LossSpecification
Type: System.Int32[]
 The tendon loss type, an item from the following list
Percent
Fixed
Detailed
 Once the loss type is known, the functions GetLossesDetailed(String, Int32, String[], Double[], Double[], Double[], Double[], Double[], Double[], Double[], eItemType) , GetLossesFixed(String, Int32, String[], Double[], Double[], eItemType), and GetLossesPercent(String, Int32, String[], Double[], Double[], eItemType) can be called to retrieve additional data
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, data is retrieved for the tendon object specified by the Name item.
 If this item is Group, data is retrieved for all tendon objects in the group specified by the Name item.
 If this item is SelectedObjects, data is retrieved for all selected tendon objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace